In [1]:
from __future__  import print_function, division
import pylab as pl
import pandas as pd
import numpy as np
import os

%pylab inline

Populating the interactive namespace from numpy and matplotlib

In [ ]:
os.environ["PUIDATA"] = '/home/urwa/PUI/PUIData'

In [5]:
datestring = '201401'
df2014 = pd.read_csv(os.getenv("PUIDATA") + "/" + datestring + '-citibike-tripdata.csv')
df2014['date'] = pd.to_datetime(df2014['starttime'])
print('data points: '+str(len(df2014)))
df2014.head(2)

data points: 300400

,tripduration,starttime,stoptime,start station id,start station name,start station latitude,start station longitude,end station id,end station name,end station latitude,end station longitude,bikeid,usertype,birth year,gender,date
0,471,2014-01-01 00:00:06,2014-01-01 00:07:57,2009,Catherine St & Monroe St,40.711174,-73.996826,263,Elizabeth St & Hester St,40.717290,-73.996375,16379,Subscriber,1986,1,2014-01-01 00:00:06
1,1494,2014-01-01 00:00:38,2014-01-01 00:25:32,536,1 Ave & E 30 St,40.741444,-73.975361,259,South St & Whitehall St,40.701221,-74.012342,15611,Subscriber,1963,1,2014-01-01 00:00:38

In [6]:
datestring = '201501'
df2015 = pd.read_csv(os.getenv("PUIDATA") + "/" + datestring + '-citibike-tripdata.csv')
df2015['date'] = pd.to_datetime(df2015['starttime'])
print('data points: '+str(len(df2014)))
df2015.head(2)

data points: 300400

,tripduration,starttime,stoptime,start station id,start station name,start station latitude,start station longitude,end station id,end station name,end station latitude,end station longitude,bikeid,usertype,birth year,gender,date
0,1346,1/1/2015 0:01,1/1/2015 0:24,455,1 Ave & E 44 St,40.750020,-73.969053,265,Stanton St & Chrystie St,40.722293,-73.991475,18660,Subscriber,1960.0,2,2015-01-01 00:01:00
1,363,1/1/2015 0:02,1/1/2015 0:08,434,9 Ave & W 18 St,40.743174,-74.003664,482,W 15 St & 7 Ave,40.739355,-73.999318,16085,Subscriber,1963.0,1,2015-01-01 00:02:00

In [7]:
datestring = '201601'
df2016 = pd.read_csv(os.getenv("PUIDATA") + "/" + datestring + '-citibike-tripdata.csv')
df2016['date'] = pd.to_datetime(df2016['starttime'])
print('data points: '+str(len(df2014)))
df2016.head(2)

data points: 300400

,tripduration,starttime,stoptime,start station id,start station name,start station latitude,start station longitude,end station id,end station name,end station latitude,end station longitude,bikeid,usertype,birth year,gender,date
0,923,1/1/2016 00:00:41,1/1/2016 00:16:04,268,Howard St & Centre St,40.719105,-73.999733,3002,South End Ave & Liberty St,40.711512,-74.015756,22285,Subscriber,1958.0,1,2016-01-01 00:00:41
1,379,1/1/2016 00:00:45,1/1/2016 00:07:04,476,E 31 St & 3 Ave,40.743943,-73.979661,498,Broadway & W 32 St,40.748549,-73.988084,17827,Subscriber,1969.0,1,2016-01-01 00:00:45

In [8]:
df = df2014.copy()
df = df.append(df2015).append(df2016)

In [9]:
df.drop(['tripduration', 'starttime', 'stoptime', 'start station id',
       'start station name', 'start station latitude',
       'start station longitude', 'end station id', 'end station name',
       'end station latitude', 'end station longitude', 'bikeid', 'usertype',
       'birth year'], axis=1, inplace=True)

In [19]:
df['date'] = df['date'].dt.year

In [22]:
df.head(3)

   gender  date
0       1  2014
1       1  2014
2       1  2014

In [15]:

print(len(df.loc[df['gender']==1]))
print(np.sum(df['gender']==1))

843184
843184

In [51]:
aggregatedData = pd.DataFrame({'count' : df.groupby( ['gender','date'] ).size()}).reset_index()
aggregatedData.head(5)

   gender  date   count
0       0  2014    7269
1       0  2015    5695
2       0  2016   25707
3       1  2014  236106
4       1  2015  227764